# Index of Content:

1) DataFrame & Series Basics - Selecting Rows & Columns

2) Indexes: How to Set, Reset, and Use Indexes

3) Filtering: Using Conditionals to Filter Rows and Columns

4) Updating Rows and Columns - Modifying Data Within DataFrames

5) Add/Remove Rows and Columns From DataFrames

6) Sorting Data

7) Grouping and Aggregating - Analyzing and Exploring Your Data

We create Python Dictionaries and then import pandas library to play around

In [1]:
person = {
    "first": "Victor", 
    "last": "Vicky", 
    "email": "vic.vic@gmail.com"
}

In [2]:
person = {
    "first": "Sam", 
    "last": "Samuel", 
    "email": "sam.sam@gmail.com"
}

In [3]:
person = {
    "first": ["Victor", "Sam", "Candy"],
    "last" : ["Vicky", "Samuel", "Canna"],
    "email": ["Vic.Vic@gmail.com", "Sam.Sam@gmail.com","Can.Can@gmail.com"]
}

# 1) DataFrame & Series Basics - Selecting Rows & Columns

In [4]:
person

{'first': ['Victor', 'Sam', 'Candy'],
 'last': ['Vicky', 'Samuel', 'Canna'],
 'email': ['Vic.Vic@gmail.com', 'Sam.Sam@gmail.com', 'Can.Can@gmail.com']}

In [5]:
person['first']

['Victor', 'Sam', 'Candy']

In [6]:
import pandas as pd

In [7]:
df = pd.DataFrame(person)
df

    first    last              email
0  Victor   Vicky  Vic.Vic@gmail.com
1     Sam  Samuel  Sam.Sam@gmail.com
2   Candy   Canna  Can.Can@gmail.com

In [8]:
df['first']

0    Victor
1       Sam
2     Candy
Name: first, dtype: object

In [9]:
df[['first','last']]

    first    last
0  Victor   Vicky
1     Sam  Samuel
2   Candy   Canna

In [10]:
df.iloc[0] # Access location by integer. One of the use - when large set of data

first               Victor
last                 Vicky
email    Vic.Vic@gmail.com
Name: 0, dtype: object

In [11]:
df.iloc[[0,1]] # We can pass an integer list

    first    last              email
0  Victor   Vicky  Vic.Vic@gmail.com
1     Sam  Samuel  Sam.Sam@gmail.com

In [12]:
df.loc[[0,1], 'email'] # Pass a string

0    Vic.Vic@gmail.com
1    Sam.Sam@gmail.com
Name: email, dtype: object

In [13]:
df.loc[[0,1], ['email', 'last']] # multiple strings to be passed in [SQUARE BRACKET]

               email    last
0  Vic.Vic@gmail.com   Vicky
1  Sam.Sam@gmail.com  Samuel

In [14]:
df

    first    last              email
0  Victor   Vicky  Vic.Vic@gmail.com
1     Sam  Samuel  Sam.Sam@gmail.com
2   Candy   Canna  Can.Can@gmail.com

# 2) Indexes: How to Set, Reset, and Use Indexes

What if we want to set the email Id as an index

In [15]:
df.set_index('email')

                    first    last
email
Vic.Vic@gmail.com  Victor   Vicky
Sam.Sam@gmail.com     Sam  Samuel
Can.Can@gmail.com   Candy   Canna

In [16]:
df 
# The index did not change
# This is good because our original dat was not changed by Pandas

    first    last              email
0  Victor   Vicky  Vic.Vic@gmail.com
1     Sam  Samuel  Sam.Sam@gmail.com
2   Candy   Canna  Can.Can@gmail.com

In [17]:
df.set_index('email', inplace=False) # INPLACE = TRUE will set those value permenantly

                    first    last
email
Vic.Vic@gmail.com  Victor   Vicky
Sam.Sam@gmail.com     Sam  Samuel
Can.Can@gmail.com   Candy   Canna

In [18]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [19]:
# This will give an error because we have set the values of inplace = FALSE

# So, let us comment it out

# df.loc['vic.vic@gmail.com']

# 3) Filtering: Using Conditionals to Filter Rows and Columns

Filtering is one of the main thing in panda because that is how we begin our project in pandas

In [20]:
# Let us call Sam from our table
df

    first    last              email
0  Victor   Vicky  Vic.Vic@gmail.com
1     Sam  Samuel  Sam.Sam@gmail.com
2   Candy   Canna  Can.Can@gmail.com

In [21]:
df['last'] == 'Samuel' # It is case-sensitive*
# We get true false value. Matching result will show true where as others will be false

0    False
1     True
2    False
Name: last, dtype: bool

In [22]:
# Filt is a variable used to store the true and false value. We can pass it directly
# DONOT use filter; it is a python keyword
# USE brackets tofor tidy condition representation ((condition)|(condition))
filt = ((df['last'] == 'Samuel') | (df['first'] == 'Victor')) # pipe(|) is OR condition; can be replaced with &

In [23]:
#df[filt] # Display

In [24]:
df.loc[filt] # Both give same results; we will use the .loc

    first    last              email
0  Victor   Vicky  Vic.Vic@gmail.com
1     Sam  Samuel  Sam.Sam@gmail.com

In [25]:
df.loc[~filt] # Negate the condition

   first   last              email
2  Candy  Canna  Can.Can@gmail.com

In [26]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

Let us say we need to change the column name

In [27]:
df.columns = ['first_name', 'second_name', 'email_ID']
df # Column names are changed

  first_name second_name           email_ID
0     Victor       Vicky  Vic.Vic@gmail.com
1        Sam      Samuel  Sam.Sam@gmail.com
2      Candy       Canna  Can.Can@gmail.com

How to translate them to upper case

In [28]:
df.columns = [x.upper() for x in df.columns] # This changes them to upper case
df

  FIRST_NAME SECOND_NAME           EMAIL_ID
0     Victor       Vicky  Vic.Vic@gmail.com
1        Sam      Samuel  Sam.Sam@gmail.com
2      Candy       Canna  Can.Can@gmail.com

Let us replace the _ with '  '

In [29]:
df.columns = df.columns.str.replace('_', ' ') 
df

  FIRST NAME SECOND NAME           EMAIL ID
0     Victor       Vicky  Vic.Vic@gmail.com
1        Sam      Samuel  Sam.Sam@gmail.com
2      Candy       Canna  Can.Can@gmail.com

Let us reset back two steps

In [30]:
df.columns = [x.lower() for x in df.columns]
df.columns = df.columns.str.replace(' ', '_')
df

  first_name second_name           email_id
0     Victor       Vicky  Vic.Vic@gmail.com
1        Sam      Samuel  Sam.Sam@gmail.com
2      Candy       Canna  Can.Can@gmail.com

In [31]:
df.rename (columns={'first_name': 'first', 'second_name': 'last'}, inplace=True) # If inplace=True is absent, it will not change
df

    first    last           email_id
0  Victor   Vicky  Vic.Vic@gmail.com
1     Sam  Samuel  Sam.Sam@gmail.com
2   Candy   Canna  Can.Can@gmail.com

Let us change Candy Canna name

In [32]:
df.loc[2]

first                   Candy
last                    Canna
email_id    Can.Can@gmail.com
Name: 2, dtype: object

In [33]:
df.loc[2] = ['Candy', 'Candice', 'candy.candy@gmail.com'] # We change the value
df

    first     last               email_id
0  Victor    Vicky      Vic.Vic@gmail.com
1     Sam   Samuel      Sam.Sam@gmail.com
2   Candy  Candice  candy.candy@gmail.com

If we want to change the selected values

In [34]:
df.loc[0,['first']] = ['victory']
df

     first     last               email_id
0  victory    Vicky      Vic.Vic@gmail.com
1      Sam   Samuel      Sam.Sam@gmail.com
2    Candy  Candice  candy.candy@gmail.com

Let us say, we want to lower case the email ID for easy searching

In [35]:
df['email_id'].str.lower()
df # It doesnot maake the change ; check next step

     first     last               email_id
0  victory    Vicky      Vic.Vic@gmail.com
1      Sam   Samuel      Sam.Sam@gmail.com
2    Candy  Candice  candy.candy@gmail.com

In [36]:
df['email_id'] = df['email_id'].str.lower()
df # It worked!!

     first     last               email_id
0  victory    Vicky      vic.vic@gmail.com
1      Sam   Samuel      sam.sam@gmail.com
2    Candy  Candice  candy.candy@gmail.com

There are four methods to do it:
    - apply: Can work on a dataframe or series of object
    - map
    - applymap
    - replace

In [37]:
df ['email_id'].apply(len) # Grab some information

0    17
1    17
2    21
Name: email_id, dtype: int64

In [38]:
def update_email(email_id): # Create function - basic example
    return email_id.upper()

In [39]:
df ['email_id'] = df ['email_id'].apply(update_email) # We donot want parenthesis, no executable version
df ['email_id']

0        VIC.VIC@GMAIL.COM
1        SAM.SAM@GMAIL.COM
2    CANDY.CANDY@GMAIL.COM
Name: email_id, dtype: object

Let us try LAMBDA function

Lambda are anonymous function. Let use it to lower case

We have a node name function and then apply; different syntax

In [40]:
df ['email_id'] = df ['email_id'].apply(lambda x: x.lower())
df ['email_id']

0        vic.vic@gmail.com
1        sam.sam@gmail.com
2    candy.candy@gmail.com
Name: email_id, dtype: object

Now let us look at how apply works on series

In [41]:
df['email_id'].apply(len)

0    17
1    17
2    21
Name: email_id, dtype: int64

In [42]:
df.apply(len, axis='columns') # This counts individual columns and their value

0    3
1    3
2    3
dtype: int64

In [43]:
len(df['email_id'])

3

In [44]:
df.apply(pd.Series.min) # This counts which one comes first in alphabetical order. Hence, Victory/Vicky are not present and Candy is there

first                       Candy
last                      Candice
email_id    candy.candy@gmail.com
dtype: object

In [45]:
df.apply(pd.Series.min)

first                       Candy
last                      Candice
email_id    candy.candy@gmail.com
dtype: object

In [46]:
#Useful when dataframe comprises numerical data. Use Numpy to apply the square root for our series or any type of numerical 
df.apply(lambda x: x.min()) # x is going to be a Series; It gives the same response as above

first                       Candy
last                      Candice
email_id    candy.candy@gmail.com
dtype: object

Apply map only runs on a dataframe. Series object doesnot have apply map!

In [47]:
df.columns = [x.lower() for x in df.columns]
df

     first     last               email_id
0  victory    Vicky      vic.vic@gmail.com
1      Sam   Samuel      sam.sam@gmail.com
2    Candy  Candice  candy.candy@gmail.com

In [48]:
df.applymap(len) # Applying function to each entry

   first  last  email_id
0      7     5        17
1      3     6        17
2      5     7        21

In [49]:
df.applymap(str.lower) #This converts each string to lowercase

     first     last               email_id
0  victory    vicky      vic.vic@gmail.com
1      sam   samuel      sam.sam@gmail.com
2    candy  candice  candy.candy@gmail.com

map is used for substituting each value in a series with another value

In [50]:
df['first'].map({'victory':'Vector'})

0    Vector
1       NaN
2       NaN
Name: first, dtype: object

# 5) Add/Remove Rows and Columns From DataFrames

In [51]:
df['first']+ ' ' + df['last'] # We merge two columns

0    victory Vicky
1       Sam Samuel
2    Candy Candice
dtype: object

In [52]:
df['full_name'] = df['first']+ ' ' + df['last'] # Add a new Column
df

     first     last               email_id      full_name
0  victory    Vicky      vic.vic@gmail.com  victory Vicky
1      Sam   Samuel      sam.sam@gmail.com     Sam Samuel
2    Candy  Candice  candy.candy@gmail.com  Candy Candice

Suppose we want to delete the first two columns

In [53]:
df.drop(columns=['first', 'last'], inplace=True)
df

                email_id      full_name
0      vic.vic@gmail.com  victory Vicky
1      sam.sam@gmail.com     Sam Samuel
2  candy.candy@gmail.com  Candy Candice

Let us say we want to split the full name & get back

In [54]:
df['full_name'].str.split(' ')

0    [victory, Vicky]
1       [Sam, Samuel]
2    [Candy, Candice]
Name: full_name, dtype: object

In [55]:
df['full_name'].str.split(' ', expand=True)

         0        1
0  victory    Vicky
1      Sam   Samuel
2    Candy  Candice

In [56]:
df[['first', 'last']] =df['full_name'].str.split(' ', expand=True)
df

                email_id      full_name    first     last
0      vic.vic@gmail.com  victory Vicky  victory    Vicky
1      sam.sam@gmail.com     Sam Samuel      Sam   Samuel
2  candy.candy@gmail.com  Candy Candice    Candy  Candice

In [57]:
df.append({'first':'Tony','last':'Tob'},ignore_index=True)

                email_id      full_name    first     last
0      vic.vic@gmail.com  victory Vicky  victory    Vicky
1      sam.sam@gmail.com     Sam Samuel      Sam   Samuel
2  candy.candy@gmail.com  Candy Candice    Candy  Candice
3                    NaN            NaN     Tony      Tob

In [58]:
# Creating new df
person = {
    "first": ["Tony", "Steve", "Peter"],
    "last" : ["Stark", "Roger", "Parker"],
    "email_id": ["ironman@avenge.com", "cap@avenge.com","spidy@avenge.com"]
}
df2 = pd.DataFrame(person)
df2

   first    last            email_id
0   Tony   Stark  ironman@avenge.com
1  Steve   Roger      cap@avenge.com
2  Peter  Parker    spidy@avenge.com

In [59]:
df = df.append(df2, ignore_index=True, sort=True) # To append we create a new 'df' variable and append old df and df2
df

                email_id    first      full_name     last
0      vic.vic@gmail.com  victory  victory Vicky    Vicky
1      sam.sam@gmail.com      Sam     Sam Samuel   Samuel
2  candy.candy@gmail.com    Candy  Candy Candice  Candice
3     ironman@avenge.com     Tony            NaN    Stark
4         cap@avenge.com    Steve            NaN    Roger
5       spidy@avenge.com    Peter            NaN   Parker

Let us say we want to remove spidy

In [60]:
df.drop(index=5) # We list them through index

                email_id    first      full_name     last
0      vic.vic@gmail.com  victory  victory Vicky    Vicky
1      sam.sam@gmail.com      Sam     Sam Samuel   Samuel
2  candy.candy@gmail.com    Candy  Candy Candice  Candice
3     ironman@avenge.com     Tony            NaN    Stark
4         cap@avenge.com    Steve            NaN    Roger

In [61]:
# df.drop(index=df[['last'] == 'Samuel'].index)
# This code is not reaader friendly; so store it in 'filt'

filt = df['first'] == 'victory'
df.drop(index=df[filt].index)

                email_id  first      full_name     last
1      sam.sam@gmail.com    Sam     Sam Samuel   Samuel
2  candy.candy@gmail.com  Candy  Candy Candice  Candice
3     ironman@avenge.com   Tony            NaN    Stark
4         cap@avenge.com  Steve            NaN    Roger
5       spidy@avenge.com  Peter            NaN   Parker

# 6) Sorting Data

In [62]:
df

                email_id    first      full_name     last
0      vic.vic@gmail.com  victory  victory Vicky    Vicky
1      sam.sam@gmail.com      Sam     Sam Samuel   Samuel
2  candy.candy@gmail.com    Candy  Candy Candice  Candice
3     ironman@avenge.com     Tony            NaN    Stark
4         cap@avenge.com    Steve            NaN    Roger
5       spidy@avenge.com    Peter            NaN   Parker

In [63]:
df.sort_values(by=['last'], ascending=False) # We can pass a list

                email_id    first      full_name     last
0      vic.vic@gmail.com  victory  victory Vicky    Vicky
3     ironman@avenge.com     Tony            NaN    Stark
1      sam.sam@gmail.com      Sam     Sam Samuel   Samuel
4         cap@avenge.com    Steve            NaN    Roger
5       spidy@avenge.com    Peter            NaN   Parker
2  candy.candy@gmail.com    Candy  Candy Candice  Candice

In [67]:
df.sort_values(by=['last','first'], ascending=[False, True], inplace=True) 
df

                email_id    first      full_name     last
0      vic.vic@gmail.com  victory  victory Vicky    Vicky
3     ironman@avenge.com     Tony            NaN    Stark
1      sam.sam@gmail.com      Sam     Sam Samuel   Samuel
4         cap@avenge.com    Steve            NaN    Roger
5       spidy@avenge.com    Peter            NaN   Parker
2  candy.candy@gmail.com    Candy  Candy Candice  Candice

In [68]:
df.sort_index()

                email_id    first      full_name     last
0      vic.vic@gmail.com  victory  victory Vicky    Vicky
1      sam.sam@gmail.com      Sam     Sam Samuel   Samuel
2  candy.candy@gmail.com    Candy  Candy Candice  Candice
3     ironman@avenge.com     Tony            NaN    Stark
4         cap@avenge.com    Steve            NaN    Roger
5       spidy@avenge.com    Peter            NaN   Parker

# 7) Grouping and Aggregating - Analyzing and Exploring Your Data